In [7]:
import pandas as pd
import numpy as np
data3 = pd.read_csv("..//raw//DGS10(10 years).csv",header=None) #relative path represented as ..
data3.columns=['Date3','DSG(10 year)']
print(data3.columns)

Index(['Date3', 'DSG(10 year)'], dtype='object')

In [8]:
#removed the uncessary 0th index row
data3=data3.drop(index=[0])
data3

            Date3 DSG(10 year)
1      1962-01-02         4.06
2      1962-01-03         4.03
3      1962-01-04         3.99
4      1962-01-05         4.02
5      1962-01-08         4.03
...           ...          ...
16424  2024-12-13         4.40
16425  2024-12-16         4.39
16426  2024-12-17         4.40
16427  2024-12-18         4.50
16428  2024-12-19         4.57

[16428 rows x 2 columns]

In [9]:
data3['Date3'] = pd.to_datetime(data3['Date3'], format='%Y-%m-%d',errors='coerce')
data3['DSG(10 year)']=pd.to_numeric(data3['DSG(10 year)'],errors='coerce') 
data3=data3.dropna(subset=['Date3'])  #drop rows with invalid data
data3

           Date3  DSG(10 year)
1     1962-01-02          4.06
2     1962-01-03          4.03
3     1962-01-04          3.99
4     1962-01-05          4.02
5     1962-01-08          4.03
...          ...           ...
16424 2024-12-13          4.40
16425 2024-12-16          4.39
16426 2024-12-17          4.40
16427 2024-12-18          4.50
16428 2024-12-19          4.57

[16428 rows x 2 columns]

In [10]:
data3['Date3'] = pd.to_datetime(data3['Date3'])
data3=data3.set_index('Date3')
quarterly3=data3.resample('ME').mean() 
quarterly3['DSG(10 year)'] = quarterly3['DSG(10 year)'].interpolate(method='time', limit_direction='both')
quarterly3.reset_index(inplace=True)  
print(quarterly3)

         Date3  DSG(10 year)
0   1962-01-31      4.083182
1   1962-02-28      4.039444
2   1962-03-31      3.930455
3   1962-04-30      3.843000
4   1962-05-31      3.873636
..         ...           ...
751 2024-08-31      3.870909
752 2024-09-30      3.723500
753 2024-10-31      4.095455
754 2024-11-30      4.355789
755 2024-12-31      4.299286

[756 rows x 2 columns]

In [11]:
quarterly3.to_csv("DSG(10 year).csv", index=False)

In [12]:
quarterly3

         Date3  DSG(10 year)
0   1962-01-31      4.083182
1   1962-02-28      4.039444
2   1962-03-31      3.930455
3   1962-04-30      3.843000
4   1962-05-31      3.873636
..         ...           ...
751 2024-08-31      3.870909
752 2024-09-30      3.723500
753 2024-10-31      4.095455
754 2024-11-30      4.355789
755 2024-12-31      4.299286

[756 rows x 2 columns]